import random

FamilyName = ['Сморчков', 'Веселков','Фомов','Остимчук','Тимофеев','Мартынов','Сидоров','Новиков','Шмидт', 'Никифоров', 'Миронов', 'Кондратьев', 'Фомов', 'Кравченко']

Addr = ['662354, г. Суна, ул. Музейная 3-я, дом 33, квартира 261', '165263, г. Тужа, ул. Хуторской 3-й Переулок, дом 83, квартира 69','153510, г. Табуны, ул. Парковая 3-я, дом 56, квартира 21','101705, г. Козловка, ул. Звенигородская, дом 18, квартира 175','678665, г. Хомутивка, ул. Николая Старостина, дом 90, квартира 281','652175, г. Гай, ул. Рождественка, дом 57, квартира 237','309771, г. Санкт-Петербург, ул. Никольско-Архангельский Проезд, дом 84, квартира 249','140235, г. Няндома, ул. 8 Марта 1-я, дом 86, квартира 140','422724, г. Чишмы, ул. Челябинская, дом 72, квартира 285', '692162, г. Магадан, ул. Тарный Проезд, дом 31, квартира 172', '301684, г. Аксай, ул. Сивцев Вражек Переулок, дом 57, квартира 263', '431280, г. Ярки, ул. Складочный Тупик, дом 4, квартира 75', '671178, г. Шилка, ул. Вилюйская, дом 8, квартира 287', '393760, г. Александровка, ул. Метростроевская, дом 86, квартира 209']

Name = ['Иларион Владимирович', 'Вениамин Ярославович','Серафим Викторович','Илья Ильич','Будимир Федорович','Олег Станиславович','Варфоломей Николаевич','Илья Александрович', 'Адис Егорович', 'Селиверст Михайлович', 'Трофим Вадимович', 'Виталий Максимович', 'Владимир Леонидович']

TelNum = ['8 (915) 219-19-40', '8 (923) 644-55-24','8 (964) 448-19-82','8 (912) 420-79-24','8 (944) 886-42-72','8 (941) 262-36-47','8 (925) 158-94-89','8 (923) 955-48-19', '8 (931) 991-82-45', '8 (945) 612-33-64', '8 (978) 997-33-72', '8 (975) 507-72-95', '8 (922) 752-26-35']

Posts = ['менеджер', 'бухгалтер', 'сотрудник отд. кадров', 'руководитель']

for x in range(10):
    print("insert into Employees (E_ID, E_FNAME, E_LNAME, E_BORN, E_GENDER, E_NPASP, E_SPASP, E_INN, E_POST, E_ADDR, E_LOGIN)\n values ('", end='')
    psw = ''
    for x in range(6):
        psw = psw + random.choice(list('123456789'))
    print(psw + "', '", end='')
    print(random.choice(FamilyName) + "', '" + random.choice(Name) + "', '", end='')
    year = random.randint(1940, 1999)
    month = random.randint(1, 12)
    day = random.randint(1, 28)
    print(str(year) + "-" + str(month) + "-" + str(day) + "', '", end='')
    ser=''
    for x in range(4):
        ser = ser + random.choice(list('123456789'))
    num=''
    for x in range(6):
        num = num + random.choice(list('123456789'))
    inn=''
    for x in range(12):
        inn = inn + random.choice(list('123456789'))    
    print(ser + "', '" + num + "', 'м', '" + inn + "', '", end = '')
    print(random.choice(Posts) + "', '" + random.choice(Addr) + "' , '", end = '')
    
    print("')")
    
    
    
